[
    {
        "id": 3,
        "date": "2024",
        "slug": "ai-tandem",
        "link": "/ai-tandem/",
        "title": {
            "rendered": "AI Tandem — Language Conversation Assistant"
        },
        "content": {
            "rendered": "<p>Marta Wlusek | Product Design | AI Tandem (2023/2024)</p><img src='/images/AI Tandem - featured.png' alt='AI Tandem app' style='max-width:100%;'/><p>To access the project presentation in Google Slides <a href='https://docs.google.com/presentation/d/15TsXednx5UM_KJL2y4j3e4ZRgCvF_gUzQHHugdKyIG0/present?slide=id.SLIDES_API1305347420_0' target='_blank'><strong>click here</strong></a></p><h2>Ideation</h2><p>This project aims to develop AI Tandem, a language learning and voice-based conversational agent designed to help users improve their foreign language skills through real-time, synchronous conversations with an AI friend and companion. </p><p>Identifying the problem mirrored in the lack of opportunities non-fluent individuals have to practice speaking foreign languages, and the challenges this can pose in both personal and professional settings, this project aspires to create a solution.</p><p>Initial ideation phase focused on an AI friend for lonely people, but this quickly transitioned into a more defined application: language learning assistance. Recognizing the limitations of existing AI-based conversation models in regard to not being trained to understand non-fluent or heavily accented speech, the project evolved into the AI Tandem concept.</p><p>AI Tandem is designed to recognize and adapt to speech loaded with foreign accents and common grammatical errors, something even experienced human teachers may struggle with. This solution will offer non-fluent speakers a judgment-free and supportive environment to practice a language with a virtual AI friend and companion that is specifically trained to understand non-fluent language speakers and guide them toward improvement in a personalized, adaptive manner.</p><h2>User Research</h2><p>Initial user research involved open-ended interviews focusing on how potential users learn foreign languages and the challenges they face. Key findings include:</p><ul><li><b>Lack of practice opportunities: </b>Many learners lack real-world environments to practice speaking a foreign language on a regular basis</li><li><b>Grammar and pronunciation support: </b>Receiving constructive feedback on these critical components can be infrequent or inconsistent.</li><li><b>Personalization: </b>Many learners feel a need for a more flexible approach that adapts to their current skill level and provides a tailored learning experience. For example, some interviewees emphasized the need for adaptable settings and potentially supplementing with explanations and translations in the user's native language.</li></ul><h2>Users and Requirements</h2><p>To better understand the target audience, a Persona was created for Joanna, a new arrival to Sweden looking to improve her Swedish to pursue a marketing career. The Jobs-to-Be-Done (JTBD) framework was used to identify Joanna’s goals, problems and needs. Overlaying these needs with the AI Tandem service persona's behavioral traits reveals a potential for alignment and the formation of a successful relationship to support Joanna’s goals. </p><img src='/images/AI Tandem - Jobs to be Done.jpeg' alt='User's JTBD' style='max-width:100%;'/><h3>Personas</h3><p>Understanding both the user and the AI agent as personas is crucial for effective interaction and user experience.</p><p><b>User Persona: </b>Joanna</p><p><b>Background: </b>A recent migrant to Sweden with previous experience in marketing, but with limited Swedish language skills.</p><p><b>Goals: </b>Improve Swedish for career development, gain conversational fluency, and overcome anxiety associated with speaking a non-fluent language.</p><p><b>Pain points: </b>Lack of Swedish-speaking networks, difficulty finding consistent practice opportunities, and fear of making mistakes when speaking.</p><p><b>Motivations: </b>Career advancement, a desire to integrate socially, and the wish to build confidence and feel more at ease when using Swedish.</p><br><p><b>AI Agent Persona: </b>AI Tandem</p><p><b>Character: </b>Patient, supportive, encouraging, and non-judgmental.</p><p><b>Capabilities: </b></p><ul><li>Adapts speech pace and vocabulary to the user's level.</li><li>Recognizes common grammar and pronunciation errors specific to the language being learned and the learner’s language background.</li><li>Provides contextually relevant corrections and suggests alternative words and phrasings for vocabulary expansion</li><li>Engages in personalized, topic-driven conversations that reflect the user's interests.</li><li>Remembers previous interactions, personal information shared by the user, and tracks learning progress.</li></ul><img src='/images/AI Tandem - Persona.png' alt='AI Tandem service persona' style='max-width:100%;'/><h3>Adaptivity & Personalization in Joanna's Customer Journey</h3><p>Here's a breakdown of how adaptivity and personalization would be integrated into each stage of Joanna's customer journey map:</p><ol><li><b>Onboarding</b></li><p><em>Adaptivity: </em>Short language assessment to gauge Joanna's initial fluency. AI Tandem adjusts initial conversation complexity accordingly.</p><em>Personalization: </em>Joanna sets her learning goals (conversational fluency, specific career vocabulary, etc.) and indicates personal interests for conversation topics.</p><li><b>Initial Engagement</b></li><p><em>Adaptivity: </em>AI Tandem continuously monitors speech patterns, recognizing recurring errors or vocabulary gaps (specific to Joanna’s native language) and provides corrections.</p><em>Personalization: </em>AI Tandem initiates conversations on topics that match Joanna's interests.</p><li><b>Personalized Interaction</b></li><p><em>Adaptivity: </em>As Joanna progresses, AI Tandem increases conversational complexity, introduces new vocabulary, and encourages her to practice more advanced grammatical structures.</p><em>Personalization: </em>Based on interests and previous conversations, AI Tandem suggests relevant topics. Joanna could potentially even provide news articles or other texts for conversational analysis.</p><li><b>Progress Tracking</b></li><p><em>Adaptivity: </em>Data analytics track Joanna's improvement over time, decreasing the frequency of corrections for common mistakes and increasing the complexity of conversations.</p><em>Personalization: </em>Specific feedback on progress toward Joanna's initial goals is regularly provided.</p><li><b>Continuous Development</b></li><p><em>Adaptivity: </em>Even as Joanna reaches higher fluency, AI Tandem continues to monitor speech and offer targeted practice, helping with fine-tuning and refinement.</p><em>Personalization: </em>AI Tandem can introduce more complex, niche, or formal topics that align with Joanna’s interests, growing language needs and personal development.</p></ol><img src='/images/AI Tandem - Customer Journey Map - Customer Journey Map.jpeg' alt='Customer Journey Map' style='max-width:100%;'/><p>The success of AI Tandem depends on Joanna’s engagement and her perception of value. The service needs to maintain a personalized, empathetic feel and demonstrate clear progress, motivating continued use.</p><h2>Design</h2><p>The project design prioritizes an adaptive, conversation-driven approach to language learning.</p><ul><p>AI Tandem features include:</p><li><b>Synchronous Voice and Video Communication</b> - simulates real-time language interactions.</li><li><b>Adaptive Difficulty and Personalization</b> - assesses the user's level and tailors conversations accordingly.</li><li><b>Grammar and Pronunciation Correction</b> - provides targeted feedback and suggests alternative words for vocabulary expansion.</li></ul><p>The design process incorporated user feedback from the initial research stage and considered guidelines for human-AI interaction (Amershi et al., 2019)  and design principles from Wärnestål (2022).</p><ul><p>Selected guidelines emphasise:</p><li><b>Clarity</b> - defining what AI Tandem can and cannot do.</li><li><b>Memory</b> - remembering recent interactions for seamless, progressive conversations.</li><li><b>Bias Awareness</b> - ensuring the service avoids making assumptions or reinforcing stereotypes through language or tone.</li></ul><ul><p>Key design requirements include:</p><li><b>Ease of Use and Engagement</b> - AI Tandem must be intuitive to use and engaging for users so they return to the service regularly</li><li><b>Feedback</b> - providing clear feedback to users regarding their progress and areas for improvement is crucial for maintaining engagement and a sense of accomplishment.</li></ul><p>The design of AI Tandem emphasizes seamless user onboarding and a personalized, adaptive feedback loop to facilitate effective language learning.</p><img src='/images/AI Tandem - User Flow.png' alt='User Flow' style='max-width:100%;'/><h3>Designing Onboarding</h3><p>The onboarding process is critical for establishing a tailored learning services and experience. Here's how it functions:</p><p><b>AI Tandem Introduction:</b> A brief introduction to how AI Tandem functions clarifies its capabilities and limitations, setting realistic expectations for the user.</p><p><b>Initial Questionnaire:</b> Joanna begins with answering a few basic questions to determine her age group, native language(s), language learning background, and desired languages along with their current levels. This step is crucial for learnability of AI Tandem, ensuring the AI's models are trained and algorithms adjusted, so that the user can receive a tailored, adaptable and valuable language learning experience.</p></p><img src='/images/AI Tandem - Onboarding.png' alt='Onboarding process' style='max-width:100%;'/><p>Additional onboarding considerations:</p><p><b>Goal Setting:</b> Joanna outlines her specific goals for using AI Tandem (e.g., conversational fluency for daily life, preparation for job interviews, focusing on specific skills like grammar or pronunciation).</p><p><b>Interest Profile:</b> Joanna selects areas of interest (e.g., hobbies, current events, professional topics) to guide AI Tandem's conversation starters and content suggestions.</p><h3>Designing Feedback Loop</h3><p>The core of AI Tandem's design lies in its continuous, personalized feedback loop:</p><p><b>Real-time Adaptations:</b> During conversations, AI Tandem analyzes Joanna's speech patterns, identifying common errors and areas for improvement. In real time, it subtly adjusts vocabulary complexity and sentence structures to provide appropriate challenges.</p><p><b>Targeted Corrections:</b> AI Tandem provides real-time feedback on pronunciation and grammar. These corrections are contextualized within the conversation, ensuring relevance and helping Joanna connect the rule to practical application.</p><p><b>Vocabulary Expansion:</b> AI Tandem suggests alternative words or phrases, aiming to expand Joanna's vocabulary within the context of her current knowledge and interests.</p><p><b>Progress Tracking:</b> AI Tandem monitors Joanna's improvement over time, tracking reductions in errors, expansion of vocabulary, and increased fluency.  Visual representations of this progress (charts, graphs) enhance motivation and engagement.</p><p><b>User Feedback:</b> Joanna is asked to provide brief feedback after some interactions, indicating whether she found the conversation's pace and difficulty level appropriate and if she understood the provided corrections. This feedback continuously fine-tunes the AI's response to Joanna’s specific needs.</p><figure><img src='/images/AI Tandem - Feedback Dialog.png' alt='Feedback dialog' style='max-width:100%;'/><figcaption>The above image represents an end-of-call feedback dialogue.</figcaption></figure><p>To streamline user feedback and further enhance the adaptive learning experience, AI Tandem employs a feedback dialogue overlay that appears at the end of a video or voice call session. This dialogue can ask for feedback on pace and difficulty, i.e., simple prompts for Joanna to rate whether the conversation speed and complexity were appropriate. This data directly informs the AI’s adaptive adjustments.</p><ul><p>The Feedback Dialogue UI element offers the following advantages:</p><li>Captures feedback immediately after the session while the experience is fresh in Joanna's mind</li><li>The overlay allows for quick, focused feedback without significantly extending the session time or disrupting the conversational flow. Additionally, the user should have the freedom of choice whether to skip the feedback or adjust information in settings.</li></ul><h3>Adaptivity & Personalization Within the Feedback Loop</h3><p>The power of this feedback loop lies in its ability to adjust to Joanna's learning progress in real-time, and in its responsiveness to her individual goals and preferences.</p><p><b>Adaptivity:</b> If Joanna rapidly masters concepts, AI Tandem increases difficulty. If she struggles with specific topics, it provides additional focused practice and support. The key is to find the optimal 'challenge zone' to encourage growth without causing discouragement.</p><p><b>Personalization:</b> If Joanna is interested in sports, explanations and examples can use sports-related vocabulary. This enhances both engagement and memorability.</p><p>Additional design considerations:</p><p><b>Interface:</b> The user interface should be intuitive and distraction-free, focusing on the voice or video conversation aspect. Visual elements augment learning but don't overwhelm the user.</p><p><b>Gamification:</b> Subtle gamification elements, like points or badges, can boost motivation for adolescent users who respond positively to them.</p><p><b>Error Tolerance:</b> AI Tandem needs to strike a balance between correction and allowing natural-sounding speech. A system that is too corrective could create frustration and break conversational flow. Striking a balance between correcting too little (letting mistakes become habits) and correcting too much (disrupting conversational flow and confidence) is a key challenge in designing the feedback loop.</p><p><b>Transparency:</b> Joanna should be able to review her progress and feedback history. This helps her understand areas for improvement and reinforces her learning journey.</p><h2>Evaluation</h2><p>Evaluating the AI Tandem prototype will involve qualitative methods and user feedback. Key evaluation metrics will focus on:</p><ul><li><b>Effectiveness:</b> Does the service help users improve their language skills?</li><li><b>Usability:</b> Is the interface easy to use, and does it guide users effectively?</li><li><b>Engagement:</b> Do users find AI Tandem engaging and use the service regularly?</li></ul><p>Feedback from potential users (as seen in the User Research section) will continue to be integrated into future development iterations. This feedback will guide changes as needed in order to increase user satisfaction. Further research into how users form an emotional connection with virtual companions as well as the impact of visual cues in the learning process will contribute to a more user-centered and effective language learning service.</p><h2>Prototype</h2><p>To access the prototype and to see the design in Figma <a href='https://www.figma.com/proto/Y4TWnrDYqo4e7gyopQjmuZ/AI-Tandem-App?type=design&node-id=70-1343&t=gAJkVBq4WlZNtp4i-0&scaling=scale-down&page-id=63%3A1336&starting-point-node-id=70%3A1337&hide-ui=1' target='_blank'><strong>click here</strong></a></p>"
        },
        "excerpt": {
            "rendered": ""
        },
        "author": "Marta Wlusek",
        "featured_media": 3,
        "_links": {
            "featuredmedia": [
                {
                    "href": "/images/AI Tandem - featured.png"
                }
            ]
        }
    },
    {
        "id": 2,
        "date": "2022",
        "slug": "apto-app",
        "link": "/apto-app/",
        "title": {
            "rendered": "APTO — App Design"
        },
        "content": {
            "rendered": "<p>Marta Wlusek | UX/UI Design | APTO (2022)</p><img src='/images/APTO-featured.png' alt='APTO app' style='max-width:100%;'/><h2>App Definition</h2><p>An app for keen out-goers who want to search for and discover interesting places to visit in a specified city or area and then save their searches and favourite places to an intuitive, minimal, and easy-to-use app.</p><p>The users can save their findings to an uncomplicated app with an intuitive interface to plan their visits in advance or refer to already visited places. They can narrow their search results to the highest-rated and most reviewed businesses and preview them on a map, see star ratings, and read top reviews in the app.</p><h3>Tagline:</h3><em>Like a travel planner, but also for locals</em><h3>App roles:</h3><ul><li><b>social</b> - people who want to discover new places to visit in their own town, who like to eat out, who like to travel</li><li><b>functional</b> - people who like to be organized, who like to take notes, who like to plan things and save time</li><li><b>political</b> - people who want to support local or new initiatives</li><li><b>personal growth</b> - people who are adventurous and want to experience new things in live</li></ul><h3>Persona:</h3><p>Jeni, 40 years old, single, primary art teacher, lives in Berlin, knows her city very well but needs to constantly discover new things to do in her town.</p><br><img src='/images/APTO-user_flow.png' alt='APTO app user flow' style='max-width:100%;'/><h3>Client/Designer goals:</h3><ol><li>provide a useful app</li><li>support local or new organizations and businesses</li><li>connect to the businesses</li></ol><h2>Wireframes</h2><img src='/images/APTO-wireframes.png' alt='APTO app wireframes' style='max-width:100%;'/><h2>Specifications</h2><img src='/images/APTO-specifications.png' alt='APTO app specifications' style='max-width:100%;'/><img src='/images/APTO-design.png' alt='APTO app design system' style='max-width:100%;'/><h2>Prototype</h2><p>To view the design and prototype in Figma <a href='https://www.figma.com/proto/nVQC4IiwZ9sfKd0DjRDUvY/DoWo?node-id=283%3A1056&scaling=scale-down&page-id=0%3A1&starting-point-node-id=645%3A741&hide-ui=1' target='_blank'</a><strong>click here</strong></p>"
        },
        "excerpt": {
            "rendered": ""
        },
        "author": "Marta Wlusek",
        "featured_media": 2,
        "_links": {
            "featuredmedia": [
                {
                    "href": "/images/APTO-featured.png"
                }
            ]
        }
    },
    {
        "id": 1,
        "date": "2022",

        "slug": "thalime",
        "link": "/thalime/",
        "title": {
            "rendered": "Thalime — Website Design"
        },
        "content": {
            "rendered": "<p>Marta Wlusek | UX/UI Design | Thalime (2022)</p><img src='/images/Thalime-featured.png' alt='Thalime website' style='max-width:100%;'/><h2>Restaurant Concept</h2><h4>Restaurant Name & Location</h4><p>Thalime</p><p>thali.me</p><p>Location: Germany, Berlin - Mitte</p><h4>Food & drink</h4><p>Indian thalis<p>Coctails<h4>Optional customization</h4><p>Compose your own thali<p>Choose from:<ul><li><b>curries:</b> chicken curry, fish curry, paneer curry, veggie curry, dal</li><li><b>rice:</b> basmati, spiced rice</li><li><b>extras:</b> chutney, jogurt, salat, vegfry</li></ul><p>Cost in €: affordable</p><h4>Main target audience</h4><p>Busy, working, and open-minded folks</p><h4>Elevator pitch</h4><em>Inspired by home-made Indian cuisine, we serve authentic, high quality and affordable thalis to bring you the experience of South India in the heart of Berlin.</em><h2>Strategy</h2><h3>Target Audience</h3><p>The website/app will focus on the following target audiences:<h4>Roles</h4><span> (groups of people with similar goals)</span><ul><li>People working in Berlin Mitte who like Asian cuisine and like to have affordable lunches or after-work dinners with co-workers in the area.</li><li>People living in Berlin Mitte who like traveling and trying new food, eat often Asian cuisine, and who are looking for a variety of Asian food in their neighbourhood</li><li>Tourists who visit famous Mitte neighbourhood, have already tried German food, so next up feel like eating something more spicy and good</li></ul><h4>Demographics</h4><ul><li><b>Gender</b> - all genders<li><b>Education</b> - somewhat higher, could be still studying as well<l/i><li><b>Occupations</b> - office workers, shop managers, creatives working in start-ups, cultural workers, interns, working students, retirees living in the area</li><li><b>Age</b> - all age groups</li><li><b>Location</b> - Berlin Mitte (city center)</li></ul><h4>Psychographics</h4><span> (personality, values, attitudes, interests, lifestyles)</span><ul><li><b>Personality & Attitudes:</b> open-minded, adventurous, out-going</li><li><b>Values:</b> left-leaning liberal</li><li><b>Lifestyles:</b> active, social, taking holidays on other continents</li></ul><h3>User Personas</h3><div class='persona'><img src='/images/Lisa.jpg'/><div><p><b>Lisa (26 years) - “The Trendsetter”</b></p><ul><li>Shop manager of a small Scandinavian style boutique with cloths and custom made jewellery</li><li>Vegan</li><li>Social, meets friends after work</li><li>Likes to try out new things</li><li>Likes to eat out in trendy but affordable places</li><li>“Be different Babe”</li></ul></div></div><div class='persona'><img src='/images/Marc.jpg'/><div><p><b>Marc (38 years) - “The founder”</b></p><ul><li>Founder and owner of a gallery in Berlin Mitte</li><li>Appreciates originality and authenticity</li><li>Has visited many counties</li><li>Workaholic</li><li>“Creativity takes courage”</li></ul></div></div><div class='persona'><img src='/images/Susane.jpg'/><div><p><b>Susane (59 years) - “The Hobbiyst”</b></p><ul><li>Lives in Berlin Mitte</li> <li>Have lots of free time to pursue her hobbies</li><li>Environmentally friendly</li><li>Supports local businesses</li><li>Experiments with different cuisines</li><li>“Enjoy the little things in Live”</li></ul></div></div><h3>User Needs</h3><p>The website needs to enable the user to:</p><ul><li>Find out if the restaurant delivers to their area</li><li>Order food online (including customisation)</li><li>Find out about the restaurants opening hours and location</li><li>Find contact details to reserve a table</li><li>View menu with prices</li><li>Find out about the restaurants philosophy and experience behind the food</li></ul><h3>Client Needs</h3><p>The website needs to enable the client to:</p><ul><li>To sell food online that will be delivered</li><li>Provide a system for order customisation</li><li>Provide a table booking system</li><li>Edit easily content on the website so the website visitors alway get up-to-date information, such as opening hours, menu and prices, etc.</li><li>Communicate attractiveness and affordability (value for money)</li><li>Demonstrate authenticity</li><li>Increase presence and popularity</li></ul><h2>Outline of Scope</h2><h3>Content Requirements</h3><p>Content (text, images, video) that the user will need<br>“The user will be looking for…”</p><ul><li>Delivery information</li><li>Opening hours and directions</li><li>Contact information</li><li>Menu with ingredients and prices</li><li>Images of dishes and the restaurants interior</li><li>A story about experience behind the food served that communicate authenticity</li></ul><h3>Functionality Requirements</h3><p>Systems that will allow the user accomplish tasks.</br>“The user will be able to…”</p><ul><li>Place an order online</li><li>Pick from ready thali compositions or select from separate options to compose their thali</li><li>Choose a method of payment</li><li>Receive confirmation of the order placed</li><li>Book a table on the website through a contact form</li><li>Pick date and time for reservations</li><li>Delivery information</li></ul><h2>Sitemap</h2><img src='/images/Thalime-Sitemap.jpg' alt='sitemap' style='max-width:100%;'/><h2>Wireframes</h2><div style='text-align:center;'><img src='/images/Thalime-Wireframe-Home.png' alt='wireframe' style='max-width:70%;padding: 10px;'/><img src='/images/Thalime-Wireframe-Mobile.png' alt='wireframe' style='max-width:22%;padding: 10px;'/></div><div style='text-align:center;'><img src='/images/Thalime-Wireframe-Order1.png' alt='wireframe' style='max-width:33%;padding: 10px;'/><img src='/images/Thalime-Wireframe-Order2.png' alt='wireframe' style='max-width:33%;padding: 10px;'/><img src='/images/Thalime-Wireframe-Order3.png' alt='wireframe' style='max-width:33%;padding: 10px;'/></div><h2>Moodboard</h2><img src='/images/Thalime-Moodboard.png' alt='moodboard' style='max-width:100%;'/><h2>Prototype</h2><p>To open the prototype and to see the design in Figma <a href='https://www.figma.com/proto/vtJFgE3lkvtxomSkiJEqR5/Thalime?type=design&node-id=31-1472&t=YvXwt3pPf2gTcKpZ-8&scaling=min-zoom&page-id=31%3A1471&starting-point-node-id=31%3A1472&hide-ui=1' target='_blank'><strong>click here</strong></a></p>"
        },
        "excerpt": {
            "rendered": ""
        },
        "author": "Marta Wlusek",
        "featured_media": 1,
        "_links": {
            "featuredmedia": [
                {
                    "href": "/images/Thalime-featured.png"
                }
            ]
        }
    }
]
